"""
Укажите значения логических переменных K, L, M, N, при которых значение логического вырыжения
(НЕ К ИЛИ М) ИЛИ (НЕ L ИЛИ М ИЛИ N) будет ложным
"""
"""
2^4 = 16
K   L   M   N
0   0   0   0   -
0   0   0   1   -
0   0   1   0   -
0   0   1   1   -
0   1   0   0   -
0   1   0   1   -  
0   1   1   0   -
0   1   1   1   -
1   0   0   0   -
1   0   0   1   -
1   0   1   0   -
1   0   1   1   -
1   1   0   0   +
1   1   0   1
1   1   1   0
1   1   1   1


"""
K = 1
L = 1
M = 0
N = 0

f1 = (not K or M) or (not L or M or N)
print("f1 = ", f1)
